mdbsliguo/stm32_template_SPL/Examples/DMA/DMA02_UART1toMemory/board.h
/**
 * @file board.h
 * @brief 硬件配置头文件（DMA02案例独立工程专用）
 * @details 此文件包含DMA02案例所需的硬件配置
 * 
 * 注意：这是独立工程的board.h，包含案例所需的硬件配置
 */

#ifndef BOARD_H
#define BOARD_H

#include "stm32f10x.h"
#include <stdint.h>

/* ==================== LED配置 ==================== */

/* LED配置结构体 */
typedef struct
{
    GPIO_TypeDef *port;   /**< GPIO端口基地址 */
    uint16_t pin;         /**< 引脚号 */
    uint8_t active_level; /**< 有效电平（Bit_SET或Bit_RESET） */
    uint8_t enabled;      /**< 使能标志：1=启用，0=禁用 */
} LED_Config_t;

/* LED统一配置表 - DMA02案例配置 */
#define LED_CONFIGS {                                                    \
    {GPIOA, GPIO_Pin_1, Bit_RESET, 1}, /* LED1：PA1，低电平点亮，启用（系统状态指示） */ \
}

/* ==================== OLED配置 ==================== */

/* OLED I2C接口类型 */
typedef enum {
    OLED_I2C_TYPE_SOFTWARE = 0,  /**< 软件I2C接口 */
    OLED_I2C_TYPE_HARDWARE = 1,  /**< 硬件I2C接口 */
} OLED_I2C_Type_t;

/* OLED I2C配置结构体（保留用于向后兼容） */
typedef struct
{
    GPIO_TypeDef *scl_port; /**< SCL引脚端口 */
    uint16_t scl_pin;       /**< SCL引脚号 */
    GPIO_TypeDef *sda_port; /**< SDA引脚端口 */
    uint16_t sda_pin;       /**< SDA引脚号 */
} OLED_I2C_Config_t;

/* OLED I2C配置 - DMA02案例配置 */
#define OLED_I2C_CONFIG {      \
    GPIOB,                     \
    GPIO_Pin_8, /* SCL: PB8 */ \
    GPIOB,                     \
    GPIO_Pin_9, /* SDA: PB9 */ \
}

/* OLED I2C接口类型配置（默认使用软件I2C） */
#ifndef OLED_I2C_TYPE
#define OLED_I2C_TYPE OLED_I2C_TYPE_SOFTWARE
#endif

/* OLED I2C实例配置（根据接口类型选择） */
#ifndef OLED_I2C_SOFT_INSTANCE
#define OLED_I2C_SOFT_INSTANCE 0  /* SOFT_I2C_INSTANCE_1 */
#endif

#ifndef OLED_I2C_HARD_INSTANCE
#define OLED_I2C_HARD_INSTANCE 0  /* I2C_INSTANCE_1 */
#endif

/* ==================== 软件I2C配置 ==================== */

/* 软件I2C配置结构体 */
typedef struct
{
    GPIO_TypeDef *scl_port;         /**< SCL引脚端口 */
    uint16_t scl_pin;               /**< SCL引脚号 */
    GPIO_TypeDef *sda_port;         /**< SDA引脚端口 */
    uint16_t sda_pin;               /**< SDA引脚号 */
    uint32_t delay_us;              /**< I2C时序延时（微秒），建议值：5-10us（标准模式），2-5us（快速模式） */
    uint8_t enabled;                /**< 使能标志：1=启用，0=禁用 */
} SoftI2C_Config_t;

/* 软件I2C统一配置表 - DMA02案例配置 */
/* 注意：数组索引对应SoftI2C_Instance枚举值，SoftI2C_INSTANCE_1=0 */
#define SOFT_I2C_CONFIGS {                                                                    \
    {GPIOB, GPIO_Pin_8, GPIOB, GPIO_Pin_9, 5, 1}, /* SoftI2C1：PB8(SCL), PB9(SDA)，5us延时，启用（OLED使用） */ \
}

/* ==================== UART配置 ==================== */

/* UART配置结构体 */
typedef struct
{
    USART_TypeDef *uart_periph;  /**< UART外设（USART1/2/3） */
    GPIO_TypeDef *tx_port;       /**< TX引脚端口 */
    uint16_t tx_pin;             /**< TX引脚号 */
    GPIO_TypeDef *rx_port;       /**< RX引脚端口 */
    uint16_t rx_pin;             /**< RX引脚号 */
    uint32_t baudrate;           /**< 波特率（如115200、9600等） */
    uint16_t word_length;         /**< 数据位：USART_WordLength_8b或USART_WordLength_9b */
    uint16_t stop_bits;          /**< 停止位：USART_StopBits_1或USART_StopBits_2 */
    uint16_t parity;             /**< 校验位：USART_Parity_No、USART_Parity_Even或USART_Parity_Odd */
    uint8_t enabled;             /**< 使能标志：1=启用，0=禁用 */
} UART_Config_t;

/* UART统一配置表 - DMA02案例配置 */
/* 注意：数组索引对应UART_Instance枚举值，UART_INSTANCE_1=0 */
#define UART_CONFIGS {                                                                                    \
    {USART1, GPIOA, GPIO_Pin_9, GPIOA, GPIO_Pin_10, 115200, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No, 1}, /* UART1：PA9(TX), PA10(RX)，115200，8N1，启用（DMA接收） */ \
    {NULL, NULL, 0, NULL, 0, 0, 0, 0, 0, 0}, /* UART2：未使用，禁用 */ \
}

/* ==================== DMA配置 ==================== */

/* DMA配置结构体 */
typedef struct
{
    uint32_t peripheral_addr;    /**< 外设地址 */
    uint32_t direction;          /**< 传输方向：DMA_DIR_PeripheralSRC（外设到内存）或DMA_DIR_PeripheralDST（内存到外设） */
    uint32_t peripheral_inc;     /**< 外设地址增量：DMA_PeripheralInc_Enable或DMA_PeripheralInc_Disable */
    uint32_t memory_inc;         /**< 内存地址增量：DMA_MemoryInc_Enable或DMA_MemoryInc_Disable */
    uint32_t peripheral_data_size; /**< 外设数据宽度：DMA_PeripheralDataSize_Byte/HalfWord/Word */
    uint32_t mode;               /**< 传输模式：DMA_Mode_Normal（正常模式）或DMA_Mode_Circular（循环模式） */
    uint32_t priority;           /**< 优先级：DMA_Priority_Low/Medium/High/VeryHigh */
    uint8_t enabled;             /**< 使能标志：1=启用，0=禁用 */
} DMA_Config_t;

/* DMA统一配置表 - DMA02案例配置：UART1 RX使用DMA1_CH5（STM32F103固定映射） */
/* 注意：DMA2仅在HD/CL/HD_VL型号上可用，MD/LD型号只有DMA1 */
/* STM32F103 DMA通道映射：USART1_RX -> DMA1_CH5, USART1_TX -> DMA1_CH4 */
#define DMA_CONFIGS {                                                                                    \
    {0, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Disable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Normal, DMA_Priority_Medium, 0}, /* DMA1_CH1：未使用，禁用 */ \
    {0, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Disable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Normal, DMA_Priority_Medium, 0}, /* DMA1_CH2：未使用，禁用 */ \
    {0, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Disable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Normal, DMA_Priority_Medium, 0}, /* DMA1_CH3：未使用，禁用 */ \
    {0, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Disable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Normal, DMA_Priority_Medium, 0}, /* DMA1_CH4：未使用，禁用 */ \
    {(uint32_t)&USART1->DR, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Disable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Circular, DMA_Priority_VeryHigh, 1}, /* DMA1_CH5：UART1 RX（外设到内存），字节，循环模式，最高优先级，启用 */ \
    {0, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Disable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Normal, DMA_Priority_Medium, 0}, /* DMA1_CH6：未使用，禁用 */ \
    {0, DMA_DIR_PeripheralSRC, DMA_PeripheralInc_Enable, DMA_MemoryInc_Enable, DMA_PeripheralDataSize_Byte, DMA_Mode_Normal, DMA_Priority_Medium, 0}, /* DMA1_CH7：未使用，禁用 */ \
}

#endif /* BOARD_H */
